class Article {
    constructor(heading, content, publishDate) {
        this.heading = heading;
        this.content = content;
        this.publishDate = publishDate;
    }

    setPublishDate(d) {
        this.publishDate = publishDate;
    }

    getHTML() {
        if (new Date() < this.publishDate) {
            return "";
        }
        return `<div>
            <h2>${this.heading}</h2>
            <p>${this.content}</p>
            <hr>
        </div>`;
    }
}

const articles = [
    new Article('אובייקטיביזם',
        `אובייקטיביזם היא תורה פילוסופית אותה הגתה הסופרת איין ראנד. האובייקטיביזם היא פילוסופיה הדוגלת בקיום מציאות אובייקטיבית שאותה על האדם לגלות על ידי שימוש בשכל, ב"אגואיזם רציונלי" כנגזרת של ערך החיים, שאותו כל אדם רציונלי צריך לקבל כאמת מידה לבחירותיו, בקפיטליזם ובעקרון אי-התוקפנות, לצד תמיכה ברעיון מדינת שומר הלילה. ברמה האישית האובייקטיביזם מעודד את האדם לעסוק ביצרנות ובהגשמה עצמית. "יצרנות", במישור הכלכלי, ו"הגשמה עצמית" במובן של יצירה והשקעה של כל פרט בהוצאה לפועל של כישוריו, בעיקר האמנותיים.`,
        new Date(2024, 5, 9, 20, 40)
    ),
    new Article('רציונליזם', `רציונליזם (בעברית: שכלתנות[1]) הוא זרם פילוסופי הטוען באופן כללי, שהידע והמושגים שלנו אינם תלויים בניסיון החושים. במערב מקובל לראות בהגות הפילוסופים ביוון העתיקה את תחילתה של המחשבה הרציונלית הסדורה. הרציונליזם מבקש מהאדם להשתמש בשכלו הישר וטוען ששכלו הוא הכלי החזק ביותר בטבעו. הרציונליסטים טוענים שהידע שלנו הוא הרבה יותר גדול מהידע שהחושים שלנו מסוגלים לקלוט ולרכוש. "תוספת" ידע זאת נובעת, בדרך זו או אחרת, מתוכנו ומהחשיבה שלנו. זרם זה מנוגד לזרם האמפיריציזם הטוען שהידע שלנו נובע רק (או לפחות, ברובו) מניסיון החושים.`,
        new Date(2024, 5, 9, 20, 48)
    )
];


function articleToHTML(a) {
    return a.getHTML();

}
const articlesAsHTML = articles.map(articleToHTML).join("");

document.getElementById('content').innerHTML = articlesAsHTML;

